org/CHANGES.tex
% Created 2010-12-22 三 18:24
% !TEX TS-program = xelatex
% !TEX encoding = UTF-8
\documentclass{article}
\usepackage{xunicode}
\usepackage[slantfont,boldfont]{xeCJK}
\setmainfont{Monaco}
\setCJKmainfont[BoldFont={WenQuanYi Zen Hei}]{WenQuanYi Micro Hei}
\setCJKmonofont{WenQuanYi Micro Hei Mono}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}
\begin{document}



\title{Joint Training Plan}
\author{Zhong Zhuang}
\date{2009-12-15 }
\maketitle



\section{Research Topic and Background}
\label{sec-1}

\begin{itemize}
\item \textbf{Topic:} \emph{Automated Theorem Prover and Implementation}
\item \textbf{Background:} Certifying compiler is a way to build high-confidence software. Most of them follow the Hoare-style logic, 
    and verfify programs by proving assertions generated by the compiler. These proof can be given by hand or by 
    automated theorem prover(ATP). The difficulties are if we need to verify complicated 
    properties of programs, ATPs nowadays are not capable to deal with and if we need to 
    verify large scale programs, these assertions can be exausting for human. This research 
    came from the operation system kernel verification of previous work in our lab and aims at
    automated theorem prover development and programming language support.
\end{itemize}
\section{Collarborative Tutors}
\label{sec-2}

  Prof. Yiyun Chen  Department of Computer Science and Technology, USTC
  Prof. Zhong Shao  Department of Computer Science and Technology, Yale

  This student has been in the Research Center for High Confidence Software of
  USTC--Yale. The center is a platform for tutors and graduate students of two
  schools in related fields to carry out collaborative research and strengthen
  academic exchanges, it also enhance the research level for teachers and students
  ofUSTC.
\section{Domestic Research Preparation}
\label{sec-3}

  In the past two years I have taken charge of a certifying compiler project and developed 
  automated theorem prover for separation logic both in SML/NJ and Coq Proof Assistant. 
  I have accumulated a lot of theoretical and technical foundation from this project.

  \textbf{Theoretical Foundation:} In the period I have a profound understanding of PCC
  Framework, Programming Theory, Hoare Logic, Separation Logic and Decision Procedures. 
    
  \textbf{Technical Foundation:} During the work of program verification I benefited with
  a lot of experience and technical foundation, such as Separation Logic, Invariance Proof 
  and the use of Coq Proof Assistant.
\section{Training Program During PhD}
\label{sec-4}

\begin{enumerate}
\item \textbf{The first year:} take charge of the certifying compiler project
\item \textbf{The second year:} research topic about more practical ATP for separation logic
\item \textbf{The third year:} study and research in Yale
\item \textbf{After back:} finish the PhD. thesis and thesis defense.
\end{enumerate}
\section{Objective of Studying Abroad}
\label{sec-5}

  I will continue with the research of ATP, and improve current proof automation mechnisms in Coq and 
  programming language support for ATP. During the period that abroad one or two papers about the research results will be
  published on the international conferences or journals.

\end{document}